In [6]:
import pandas as pd

In [7]:
# Extract
csv_data = pd.read_csv("data/retail_dataset.csv")
xlsx_data = pd.read_excel("data/retail_dataset.xlsx")
json_data = pd.read_json("data/retail_dataset.json")

In [10]:
# csv_data
print(type(csv_data))
dict_csv = dict(csv_data)
print(dict_csv)

<class 'pandas.DataFrame'>
{'Customer_ID': 0     101
1     102
2     103
3     104
4     105
5     106
6     107
7     108
8     109
9     109
10    110
Name: Customer_ID, dtype: int64, 'Age': 0     22.0
1     25.0
2      NaN
3     28.0
4     35.0
5     40.0
6     29.0
7     31.0
8     45.0
9     45.0
10   -27.0
Name: Age, dtype: float64, 'Gender': 0       male
1     Female
2       Male
3     Female
4          M
5     Female
6       male
7     Female
8       Male
9       Male
10    Female
Name: Gender, dtype: str, 'Product_Category': 0     Electronics
1        clothing
2     Electronics
3         Grocery
4        Clothing
5     Electronics
6         Grocery
7        Clothing
8     Electronics
9     Electronics
10        Grocery
Name: Product_Category, dtype: str, 'Purchase_Amount': 0      500.0
1      150.0
2      700.0
3        NaN
4      200.0
5     1200.0
6       60.0
7      180.0
8      900.0
9      900.0
10      90.0
Name: Purchase_Amount, dtype: float64, 'Payment_Method': 0       Cash
1       card
2       Card
3       Cash
4       Card
5     Online
6       cash
7     Online
8       Card
9       Card
10      Cash
Name: Payment_Method, dtype: str}

In [31]:
json_data

   Customer_ID   Age  Gender Product_Category  Purchase_Amount Payment_Method
0          101  22.0    Male      electronics            500.0           Cash
1          102   NaN  Female         Clothing            150.0           CARD
2          103  30.0    male      Electronics            700.0           Card
3          104  28.0  Female          Grocery              NaN           Cash
4          105  35.0    Male         Clothing            200.0           Card
5          106  40.0  Female      Electronics           5000.0         Online
6          106  40.0  Female      Electronics           5000.0         Online

In [32]:
xlsx_data

   Customer_ID    Age  Gender Product_Category  Purchase_Amount Payment_Method
0          101   22.0    Male      Electronics            500.0           Cash
1          102   25.0  Female         Clothing            150.0           Card
2          103    NaN    male      Electronics            700.0           Card
3          104   28.0  Female          Grocery              NaN           Cash
4          105   35.0    Male         Clothing            200.0           Card
5          106   40.0  FEMALE      Electronics           1200.0         Online
6          107   29.0    Male          Grocery             60.0           Cash
7          108   31.0  Female         Clothing            180.0         Online
8          108   31.0  Female         Clothing            180.0         Online
9          110  270.0  Female          Grocery             90.0           Cash

In [33]:
csv_data.info()

<class 'pandas.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Customer_ID       11 non-null     int64
 1   Age               10 non-null     float64
 2   Gender            11 non-null     str
 3   Product_Category  11 non-null     str
 4   Purchase_Amount   10 non-null     float64
 5   Payment_Method    11 non-null     str
dtypes: float64(2), int64(1), str(3)
memory usage: 660.0 bytes

In [34]:
xlsx_data.info()

<class 'pandas.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Customer_ID       10 non-null     int64
 1   Age               9 non-null      float64
 2   Gender            10 non-null     str
 3   Product_Category  10 non-null     str
 4   Purchase_Amount   9 non-null      float64
 5   Payment_Method    10 non-null     str
dtypes: float64(2), int64(1), str(3)
memory usage: 612.0 bytes

In [35]:
json_data.info()

<class 'pandas.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Customer_ID       7 non-null      int64
 1   Age               6 non-null      float64
 2   Gender            7 non-null      str
 3   Product_Category  7 non-null      str
 4   Purchase_Amount   6 non-null      float64
 5   Payment_Method    7 non-null      str
dtypes: float64(2), int64(1), str(3)
memory usage: 468.0 bytes

Data Cleaning and Transform

In [ ]:
def clean_data(df):

    df = df.drop_duplicates()

    # numeric ma convert
    df["Age"] = pd.to_numeric(df["Age"], errors="coerce")
    df["Purchase_Amount"] = pd.to_numeric(df["Purchase_Amount"], errors="coerce")

    # Handle missing numerical values
    df["Age"] = df["Age"].fillna(df["Age"].median())
    df["Purchase_Amount"] = df["Purchase_Amount"].fillna(df["Purchase_Amount"].median())

    # Handle unrealistic age values
    df.loc[(df["Age"] < 0) | (df["Age"] > 100), "Age"] = df["Age"].median()

    # Handle missing categorical values
    df["Product_Category"] = df["Product_Category"].fillna(df["Product_Category"].mode()[0])
    df["Payment_Method"] = df["Payment_Method"].fillna(df["Payment_Method"].mode()[0])

    # Clean Gender properly
    df["Gender"] = df["Gender"].astype(str).str.strip().str.lower()
    df["Gender"] = df["Gender"].replace({
        "male": "Male",
        "m": "Male",
        "female": "Female",
        "f": "Female"
    })

    # Standardize other categorical columns
    df["Product_Category"] = df["Product_Category"].astype(str).str.strip().str.capitalize()
    df["Payment_Method"] = df["Payment_Method"].astype(str).str.strip().str.capitalize()

    # Convert types
    df["Age"] = df["Age"].astype(int)
    df["Purchase_Amount"] = df["Purchase_Amount"].astype(float)

    return df

In [37]:
csv_cleaned = clean_data(csv_data)
xlsx_cleaned = clean_data(xlsx_data)
json_cleaned = clean_data(json_data)

In [38]:
csv_cleaned

    Customer_ID  Age  Gender Product_Category  Purchase_Amount Payment_Method
0           101   22    Male      Electronics            500.0           Cash
1           102   25  Female         Clothing            150.0           Card
2           103   29    Male      Electronics            700.0           Card
3           104   28  Female          Grocery            200.0           Cash
4           105   35    Male         Clothing            200.0           Card
5           106   40  Female      Electronics           1200.0         Online
6           107   29    Male          Grocery             60.0           Cash
7           108   31  Female         Clothing            180.0         Online
8           109   45    Male      Electronics            900.0           Card
10          110   29  Female          Grocery             90.0           Cash

In [39]:
xlsx_cleaned

   Customer_ID  Age  Gender Product_Category  Purchase_Amount Payment_Method
0          101   22    Male      Electronics            500.0           Cash
1          102   25  Female         Clothing            150.0           Card
2          103   30    Male      Electronics            700.0           Card
3          104   28  Female          Grocery            190.0           Cash
4          105   35    Male         Clothing            200.0           Card
5          106   40  Female      Electronics           1200.0         Online
6          107   29    Male          Grocery             60.0           Cash
7          108   31  Female         Clothing            180.0         Online
9          110   30  Female          Grocery             90.0           Cash

In [40]:
json_cleaned

   Customer_ID  Age  Gender Product_Category  Purchase_Amount Payment_Method
0          101   22    Male      Electronics            500.0           Cash
1          102   30  Female         Clothing            150.0           Card
2          103   30    Male      Electronics            700.0           Card
3          104   28  Female          Grocery            500.0           Cash
4          105   35    Male         Clothing            200.0           Card
5          106   40  Female      Electronics           5000.0         Online

In [49]:
from sklearn.preprocessing import MinMaxScaler
from sklearn.preprocessing import LabelEncoder

In [53]:
scaler = MinMaxScaler()
le = LabelEncoder()
def transfrom_data(df):
    df[["Purchase_Amount"]] = scaler.fit_transform(
        df[["Purchase_Amount"]]
    )
    df["Gender"] = le.fit_transform(df["Gender"])

    df["Age_Group"] = pd.cut(
    df["Age"],
    bins=[0, 18, 30, 50, 100],
    labels=["Teen", "Young", "Adult", "Senior"]
)

    return df

In [54]:
csv_transformed = transfrom_data(csv_cleaned)
xlsx_transformed = transfrom_data(xlsx_cleaned)
jsn_transformed = transfrom_data(json_cleaned)

In [55]:
csv_transformed

,Customer_ID,Age,Gender,Product_Category,Purchase_Amount,Payment_Method,Age_Group
0,101,22,1,Electronics,0.385965,Cash,Young
1,102,25,0,Clothing,0.078947,Card,Young
2,103,29,1,Electronics,0.561404,Card,Young
3,104,28,0,Grocery,0.122807,Cash,Young
4,105,35,1,Clothing,0.122807,Card,Adult
5,106,40,0,Electronics,1.000000,Online,Adult
6,107,29,1,Grocery,0.000000,Cash,Young
7,108,31,0,Clothing,0.105263,Online,Adult
8,109,45,1,Electronics,0.736842,Card,Adult
10,110,29,0,Grocery,0.026316,Cash,Young

Database /Data Loading

In [56]:
import sqlite3

In [57]:
conn = sqlite3.connect("retail_database.db")

In [58]:
csv_transformed.to_sql(
    "retail_data", 
    conn,
    if_exists="replace",  
    index=False
)

10

In [59]:
cursor = conn.cursor()

In [60]:
cursor.execute("SELECT * FROM retail_data")